In [1]:
# 쥬피터노트북 셀 스타일 조절 
from IPython.core.display import display, HTML
display(HTML("<style>.container { font-weight: bold !important; }</style>"))
display(HTML("<style>.container { width: 100% !important; }</style>"))

# 경고 메세지 숨기기 
import warnings
warnings.filterwarnings(action='ignore')

In [2]:
import numpy as np 
import pandas as pd

# 데이타프레임 조회 

- 컬럼 조회 
- 행 조회 
- 컬럼+행 조회 

```
데이타프레임[컬럼명]
데이타프레임[[컬럼명1, 컬럼명2, 컬럼명3 ....]]

데이타프레임.컬럼명 

loc : location 행이름, 컬럼명 
데이타프레임.loc[행이름]
데이타프레임.loc[start:end]
데이타프레임.loc[start:end, start:end]


iloc : index location 행인덱스, 컬럼인덱스
데이타프레임.iloc[행인덱스]
데이타프레임.iloc[start:end]
데이타프레임.iloc[start:end, start:end]

행 조회 
데이타프레임[행인덱스]
데이타프레임[start:end]


```

In [4]:
data = { "name":["Haidi", "Haidi", "Haidi", "Charles", "Charles"],
        "year":[2014, 2015, 2016, 2015, 2017],
        "points":[1.5, 1.7, 3.6, 2.5, 2.9], 
        "penalty":[1, 2, 3, 4, 5] }
df1 = pd.DataFrame( data, 
                    index=["one", "two", "three", "four", "five"])
df1

          name  year  points  penalty
one      Haidi  2014     1.5        1
two      Haidi  2015     1.7        2
three    Haidi  2016     3.6        3
four   Charles  2015     2.5        4
five   Charles  2017     2.9        5

In [5]:
df1.columns

Index(['name', 'year', 'points', 'penalty'], dtype='object')

In [6]:
df1.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

##### [] 를 이용한 컬럼조회

In [7]:
# 특정 1개의 컬럼 조회 => 시리즈 
# 데이타프레임[컬럼명]
df1['name']

one        Haidi
two        Haidi
three      Haidi
four     Charles
five     Charles
Name: name, dtype: object

In [8]:
type(df1['name'])

pandas.core.series.Series

In [9]:
# 특정 1개의 컬럼 조회 => 데이타프레임
# 데이타프레임[[컬럼명]]
df1[['name']]

          name
one      Haidi
two      Haidi
three    Haidi
four   Charles
five   Charles

In [10]:
type(df1[['name']])

pandas.core.frame.DataFrame

In [12]:
# KeyError 
# df1[0]

In [13]:
# 다수개의 컬럼 조회 => 데이타프레임
# 데이타프레임[[컬럼명1, 컬럼명2 ...]]

In [16]:
df1[['year', 'name', 'points']]

       year     name  points
one    2014    Haidi     1.5
two    2015    Haidi     1.7
three  2016    Haidi     3.6
four   2015  Charles     2.5
five   2017  Charles     2.9

In [14]:
df1

          name  year  points  penalty
one      Haidi  2014     1.5        1
two      Haidi  2015     1.7        2
three    Haidi  2016     3.6        3
four   Charles  2015     2.5        4
five   Charles  2017     2.9        5

In [19]:
# 에러 발생 : 슬라이싱 x
# df1[['name':'year']]

#####  도트(.) 를 이용한 특정 컬럼 조회  => 시리즈

In [21]:
df1.name

one        Haidi
two        Haidi
three      Haidi
four     Charles
five     Charles
Name: name, dtype: object

##### loc 방식으로 컬럼 조회 

- 데이타프레임.loc[:, 컬럼명] => 시리즈 
- 데이타프레임.loc[:, 컬럼명1:컬럼명2] => 데이타프레임

In [22]:
df1.loc[:, 'name']

one        Haidi
two        Haidi
three      Haidi
four     Charles
five     Charles
Name: name, dtype: object

In [23]:
# 컬럼명을 이용한 슬라이싱 
df1.loc[:, 'name':'points']

          name  year  points
one      Haidi  2014     1.5
two      Haidi  2015     1.7
three    Haidi  2016     3.6
four   Charles  2015     2.5
five   Charles  2017     2.9

##### iloc 방식으로 컬럼 조회  : 위치인덱스 숫자 이용

- 데이타프레임.iloc[:, 컬럼인덱스] => 시리즈 
- 데이타프레임.iloc[:, 컬럼인덱스1:컬럼인덱스2] => 데이타프레임

In [26]:
# 특정 컬럼 1개 
df1.iloc[:, 0]

one        Haidi
two        Haidi
three      Haidi
four     Charles
five     Charles
Name: name, dtype: object

In [29]:
# 연속 컬럼 슬라이싱 => 데이타프레임
df1.iloc[:, 0:2]

          name  year
one      Haidi  2014
two      Haidi  2015
three    Haidi  2016
four   Charles  2015
five   Charles  2017

##### loc 방식으로 행 조회 
- 데이타프레임.loc[인덱스명] => 시리즈 
- 데이타프레임.loc[[인덱스명]] => 데이타프레임
- 데이타프레임.loc[인덱스명, :] => 시리즈 
- 데이타프레임.loc[인덱스명1:인덱스명2, :] => 데이타프레임
- 데이타프레임.loc[[인덱스명1, 인덱스명2 ...], :] => 데이타프레임

In [32]:
# 특정행 조회 => 시리즈 
df1.loc['three']

name       Haidi
year        2016
points       3.6
penalty        3
Name: three, dtype: object

In [34]:
df1.loc['three', :]

name       Haidi
year        2016
points       3.6
penalty        3
Name: three, dtype: object

In [33]:
# 특정행 조회 => 데이타프레임 
df1.loc[['three']]

        name  year  points  penalty
three  Haidi  2016     3.6        3

In [35]:
# 불연속인 행 조회 - two, five
df1.loc[['two', 'five']]

         name  year  points  penalty
two     Haidi  2015     1.7        2
five  Charles  2017     2.9        5

In [36]:
# 연속적인 행 조회 => 데이타프레임 슬라이싱 
df1.loc['two':'four']

          name  year  points  penalty
two      Haidi  2015     1.7        2
three    Haidi  2016     3.6        3
four   Charles  2015     2.5        4

##### iloc 방식으로 행 조회  : 위치인덱스 숫자 이용

- 데이타프레임.iloc[행인덱스] => 시리즈 
- 데이타프레임.iloc[행인덱스1:행인덱스2] => 데이타프레임

In [37]:
# 마지막 행 
df1.iloc[-1]

name       Charles
year          2017
points         2.9
penalty          5
Name: five, dtype: object

In [42]:
# 슬라이싱
df1.iloc[1:4]

          name  year  points  penalty
two      Haidi  2015     1.7        2
three    Haidi  2016     3.6        3
four   Charles  2015     2.5        4

In [43]:
# 불연속인 행 조회 
df1.iloc[[0, 2, -1]]

          name  year  points  penalty
one      Haidi  2014     1.5        1
three    Haidi  2016     3.6        3
five   Charles  2017     2.9        5

In [53]:
# 특정행의 특정열 조회 : 슬라이싱
# 데이타프레임명.iloc[start1:end1, start2:end2]
# 데이타프레임명.loc[인덱스명1:인덱스명2, 컬럼명1:컬럼명2]

# 특정행의 특정열의 값 
# 데이타프레임명.iloc[행인덱스, 열인덱스]
# 데이타프레임명.loc[행이름, 열이름]

In [50]:
df1.loc['two':'three', 'name':'year']

        name  year
two    Haidi  2015
three  Haidi  2016

In [52]:
df1.iloc[1:3, 0:2]

        name  year
two    Haidi  2015
three  Haidi  2016

In [55]:
df1.iloc[0, 2], df1.loc['one', 'points']

(1.5, 1.5)

In [56]:
# 맨 앞의 특정행의 갯수 조회 - 데이타프레임명.head(n)
# 맨뒤의 특정행의 갯수 조회 - 데이타프레임명.tail(n)
# n은 기본값 5 

# 무작위 특정행의 갯수 조회 - 데이타프레임명.sample(n)
# n 은 기본값1

In [57]:
data = np.random.randint(1,300,100).reshape(-1,5)
df2 = pd.DataFrame(data)

In [60]:
df2.shape

(20, 5)

In [61]:
df2.head(2)

    0    1    2    3    4
0  44  213  257   29  146
1  72  275  124  269  184

In [62]:
df2.tail(3)

      0    1    2    3    4
17  163   17  197   55  122
18   90   66  269  105   26
19   92  175  251  298    7

In [63]:
df2.sample()

      0   1    2   3   4
12  221  23  209  50  90

In [64]:
df2.sample(3)

      0    1    2    3    4
0    44  213  257   29  146
15  137  147  214  217   56
11    7  177  230  195   27

In [59]:
df2

      0    1    2    3    4
0    44  213  257   29  146
1    72  275  124  269  184
2   154  266  267  271  181
3    14  186  174  223  195
4   142  129   29  164  224
5    73   27  217   65  235
6   186  147  125  275  108
7    10  111  151   39  167
8   176  177  176  189  164
9   184  249   87   64  182
10  248  132  139   80  161
11    7  177  230  195   27
12  221   23  209   50   90
13   36  104  119  240  189
14   57  239  131  130   30
15  137  147  214  217   56
16  179  257  216  176  233
17  163   17  197   55  122
18   90   66  269  105   26
19   92  175  251  298    7

# 행단위 열단위로 데이타 추가

- 컬럼추가 
```
데이타프레임[새로운컬럼명] = 리스트/넘파이배열/range()/기존컬럼을이용한계산식  
```

- 행추가 
```
데이타프레임.loc[새로운행명] = 리스트/넘파이배열/range()
```

In [68]:
data = { "name":["Haidi", "Haidi", "Haidi", "Charles", "Charles"],
        "year":[2014, 2015, 2016, 2015, 2017],
        "points":[1.5, 1.7, 3.6, 2.5, 2.9], 
        "penalty":[1, 2, 3, 4, 5] }
df3 = pd.DataFrame( data, 
                    index=["one", "two", "three", "four", "five"])
df3

          name  year  points  penalty
one      Haidi  2014     1.5        1
two      Haidi  2015     1.7        2
three    Haidi  2016     3.6        3
four   Charles  2015     2.5        4
five   Charles  2017     2.9        5

In [69]:
# 컬럼 추가 
df3['id'] = 10
df3

          name  year  points  penalty  id
one      Haidi  2014     1.5        1  10
two      Haidi  2015     1.7        2  10
three    Haidi  2016     3.6        3  10
four   Charles  2015     2.5        4  10
five   Charles  2017     2.9        5  10

In [71]:
# 길이 유의 
df3['addr'] = ['LA', 'LA', 'LA', 'Hawaii', 'WC', ]
df3

          name  year  points  penalty  id    addr
one      Haidi  2014     1.5        1  10      LA
two      Haidi  2015     1.7        2  10      LA
three    Haidi  2016     3.6        3  10      LA
four   Charles  2015     2.5        4  10  Hawaii
five   Charles  2017     2.9        5  10      WC

In [74]:
# 기존 컬럼과 계산식 이용 
df3['bonus'] = df3['points']*100
df3

          name  year  points  penalty  id    addr  bonus
one      Haidi  2014     1.5        1  10      LA  150.0
two      Haidi  2015     1.7        2  10      LA  170.0
three    Haidi  2016     3.6        3  10      LA  360.0
four   Charles  2015     2.5        4  10  Hawaii  250.0
five   Charles  2017     2.9        5  10      WC  290.0

In [75]:
# 행추가 
df3.loc['six'] = ['Charles', 2017, 3.3, 6, 30, 'WC', 290.0]
df3

          name  year  points  penalty  id    addr  bonus
one      Haidi  2014     1.5        1  10      LA  150.0
two      Haidi  2015     1.7        2  10      LA  170.0
three    Haidi  2016     3.6        3  10      LA  360.0
four   Charles  2015     2.5        4  10  Hawaii  250.0
five   Charles  2017     2.9        5  10      WC  290.0
six    Charles  2017     3.3        6  30      WC  290.0

In [77]:
df3.dtypes

name        object
year         int64
points     float64
penalty      int64
id           int64
addr        object
bonus      float64
dtype: object

In [78]:
# ValueError - 길이 주의 
df3.loc['seven'] = [True, 2017, 3.3, 6, 30, 'WC', 290.0]
df3

          name  year  points  penalty  id    addr  bonus
one      Haidi  2014     1.5        1  10      LA  150.0
two      Haidi  2015     1.7        2  10      LA  170.0
three    Haidi  2016     3.6        3  10      LA  360.0
four   Charles  2015     2.5        4  10  Hawaii  250.0
five   Charles  2017     2.9        5  10      WC  290.0
six    Charles  2017     3.3        6  30      WC  290.0
seven     True  2017     3.3        6  30      WC  290.0

In [79]:
# 자료형 테스트 
df3.loc['eight'] = ['Haidi', '2020년', 3.3, 6, 30, 'WC', 290.0]
df3

          name   year  points  penalty  id    addr  bonus
one      Haidi   2014     1.5        1  10      LA  150.0
two      Haidi   2015     1.7        2  10      LA  170.0
three    Haidi   2016     3.6        3  10      LA  360.0
four   Charles   2015     2.5        4  10  Hawaii  250.0
five   Charles   2017     2.9        5  10      WC  290.0
six    Charles   2017     3.3        6  30      WC  290.0
seven     True   2017     3.3        6  30      WC  290.0
eight    Haidi  2020년     3.3        6  30      WC  290.0

In [80]:
df3.dtypes

name        object
year        object
points     float64
penalty      int64
id           int64
addr        object
bonus      float64
dtype: object

In [84]:
# 테스트 : iloc 로 행 삽입이 가능할까?
# IndexError => x
# df3.iloc[8] = ['Haidi', '2020년', 3.3, 6, 30, 'WC', 290.0]
# df3

In [81]:
df3.shape

(8, 7)

# 기존 값 수정하기 

```
데이타프레임.loc[행명, 열명] = 새로운값
데이타프레임.iloc[행인덱스, 열인덱스] = 새로운값


```

In [87]:
df3.loc['one', 'name'] = 'Julia'

In [90]:
df3.iloc[-1, -1] = 500

In [92]:
# 슬라이싱한 상태에서 값 교체 
df3.loc['one':'three', 'penalty'] = -500

In [96]:
df3.shape

(8, 7)

In [100]:
df3.shape[0]

8

In [103]:
np.arange(0, df3.shape[0])

array([0, 1, 2, 3, 4, 5, 6, 7])

In [109]:
# 특정 컬럼 전체의 값 교체 
df3['id'] = np.arange(1, df3.shape[0]+1)*10

In [110]:
df3

          name   year  points  penalty  id    addr  bonus
one      Julia   2014     1.5     -500  10      LA  150.0
two      Haidi   2015     1.7     -500  20      LA  170.0
three    Haidi   2016     3.6     -500  30      LA  360.0
four   Charles   2015     2.5        4  40  Hawaii  250.0
five   Charles   2017     2.9        5  50      WC  290.0
six    Charles   2017     3.3        6  60      WC  290.0
seven     True   2017     3.3        6  70      WC  290.0
eight    Haidi  2020년     3.3        6  80      WC  500.0

In [86]:
df3

          name   year  points  penalty  id    addr  bonus
one      Haidi   2014     1.5        1  10      LA  150.0
two      Haidi   2015     1.7        2  10      LA  170.0
three    Haidi   2016     3.6        3  10      LA  360.0
four   Charles   2015     2.5        4  10  Hawaii  250.0
five   Charles   2017     2.9        5  10      WC  290.0
six    Charles   2017     3.3        6  30      WC  290.0
seven     True   2017     3.3        6  30      WC  290.0
eight    Haidi  2020년     3.3        6  30      WC  290.0